src/DataProcessors/ЗагрузкаКартинокМурена/ЗагрузкаКартинокМурена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКартинокМурена</name>
  <comment>загрузка картинок из файлов по проекту Мурена</comment>
</mdclass:DataProcessor>

src/InformationRegisters/ЛогЗагрузки/ЛогЗагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогЗагрузки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>СтруктураДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект1С</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ОКЕИ</types>
      <types>CatalogRef.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля</types>
      <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      <types>CatalogRef.БоевыеЧасти</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.Заявка</types>
      <types>CatalogRef.ПроектыКораблей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      <types>CatalogRef.ОКСМ</types>
      <types>CatalogRef.ЗаказыПрисоединенныеФайлы</types>
      <types>CatalogRef.РазделыСпецификацииЗИП</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/КаталогПредметовСнабжения/КаталогПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогПредметовСнабжения</name>
  <attributes>
    <name>НомерОСК</name>
    <comment>Номер в каталоге ОСК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <comment>№ чертежа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеТранслитированное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УтвержденноеНаименование</name>
    <comment>Утвержденное наименование на русском</comment>
    <type>
      <types>CatalogRef.УтвержденныеНаименованияПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяПоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаПоставку</name>
    <comment>ТУ, ГОСТ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипДокументацииДляИзготовленияИПоставкиПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>NSN</name>
    <comment>Номер по системе кодификации НАТО</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕКПС</name>
    <type>
      <types>CatalogRef.ЕКПС</types>
    </type>
  </attributes>
  <attributes>
    <name>INCAT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурныйНомерВМФ</name>
    <comment>Номер по базе Юпитер-СТО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПД2</name>
    <type>
      <types>CatalogRef.ОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаписейСправочниковИКаталогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодСнятияСПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаУпаковкиТранспортировкиХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоСтруктуре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шифр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФНН</name>
    <comment>Федеральный номенклатурный номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШифрТранслитированный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзготовителиИПоставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокиИзготовления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПроизводства</name>
      <type>
        <types>CatalogRef.СостоянияПроизводстваПС</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗамены</name>
      <type>
        <types>CatalogRef.ТипыЗаменыПредметаСнабженияАналогом</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеДляЗаказчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеИзКСУНСИ</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ЗагрузкаКартинокМурена/Forms/Форма/Module.bsl
//ПРОЦЕДУРЫ И ФУНКЦИИ ЧТЕНИЯ ФАЙЛА
#Область ЧтениеФайла

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Не выбран файл!");
		Возврат;
	КонецЕсли; 
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьДанныеЗавершение", ЭтаФорма), "Результат предыдущей загрузки или сопоставления будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗагрузкуДанных();
	Иначе
		Сообщить("Прервано пользователем!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуДанных()
	
	Состояние("Чтение файла Excel ",,,БиблиотекаКартинок.ДлительнаяОперация48);
	
	СоответствиеПредметовСнабжения = ПолучитьСоответствиеПредметовСнабжения();
	
	КартинкиПредметовСнабжения.Очистить();
	
	Сообщить("Загрузка данных начата в "+ТекущаяДата());
	
	Файл = Новый Файл(ПутьКФайлу);
		
	СтрокаПодключения = "Provider=MSDASQL.1;Persist Security Info=False;Extended Properties=""DSN=Excel Files;DBQ=&Filename;DefaultDir=&Foldername;DriverId=1046;MaxBufferSize=2048;PageTimeout=5;""";
	СтрокаПодключения = СтрЗаменить(СтрокаПодключения,"&Filename",Файл.ПолноеИмя);
	СтрокаПодключения = СтрЗаменить(СтрокаПодключения,"&Foldername",Файл.Путь);
	
	Соединение = Новый COMОбъект("ADODB.CONNECTION");
	
	Попытка
		Соединение.Open(СтрокаПодключения);
	Исключение
		ТекИнформацияОбОшибке = "Произошла ошибка: " + ОписаниеОшибки() + ", не подключиться к источнику. Обработка прервана!";
		Сообщить(ТекИнформацияОбОшибке,СтатусСообщения.Важное);
		Возврат;
	КонецПопытки;
	
	БД = Новый COMОбъект("ADOX.Catalog");
	БД.ActiveConnection = Соединение;
	
	ТекстЗапроса =
	"select obozn, nameSys, Znach, ris
    |from [kat_print_img$]
    |where Har = 2";
	
	НаборЗаписей = Новый COMОбъект("ADODB.RecordSet");
	
	Попытка
		НаборЗаписей.CursorType = 3;
		НаборЗаписей.Open(ТекстЗапроса,Соединение);
	Исключение
		ТекИнформацияОбОшибке = "Не получены данные таблицы файла по причине "+ОписаниеОшибки();
		Сообщить(ТекИнформацияОбОшибке,СтатусСообщения.Важное);
		Возврат;
	КонецПопытки;
	
	Сч = 1;
	ВсегоСтрок = НаборЗаписей.RecordCount;
	
	ДатаНачала = ТекущаяДата();
	
	Пока НаборЗаписей.EOF()=0 Цикл
		
		УправлениеИнтерфейсом.ВывестиТекущееСостояние("Чтение данных Мурена",ДатаНачала,Сч,ВсегоСтрок);
		
		СтрокаТаблицыКартинок = КартинкиПредметовСнабжения.Добавить();
		СтрокаТаблицыКартинок.Наименование = СокрЛП(НаборЗаписей.Fields(1).Value);
		СтрокаТаблицыКартинок.Обозначение = СокрЛП(НаборЗаписей.Fields(1).Value);
		ФНН = СокрЛП(НаборЗаписей.Fields(2).Value); 
		СтрокаТаблицыКартинок.ФНН = Лев(ФНН,11)+Прав(ФНН,4);
		ПредметСнабжения = СоответствиеПредметовСнабжения.Получить(СтрокаТаблицыКартинок.ФНН);
		Если ПредметСнабжения <> Неопределено Тогда
			СтрокаТаблицыКартинок.ПредметСнабжения = ПредметСнабжения;
		Иначе
			ЗаписатьВЛог(Файл.Имя,Файл.Путь,Строка(Сч),,"Предмет снабжения "+СтрокаТаблицыКартинок.ФНН+" не найден!");
		КонецЕсли;
		СтрокаТаблицыКартинок.ПутьКФайлуКартинки = СокрЛП(НаборЗаписей.Fields(3).Value);
		Если Не ЗначениеЗаполнено(СтрокаТаблицыКартинок.ПутьКФайлуКартинки) Тогда
			ЗаписатьВЛог(Файл.Имя,Файл.Путь,Строка(Сч),,"Не указана картинка предмета снабжения "+СтрокаТаблицыКартинок.ФНН);
			СтрокаТаблицыКартинок.ФайлСуществует = Ложь;
		Иначе
			ФайлКартинки = Новый Файл(СтрокаТаблицыКартинок.ПутьКФайлуКартинки);
			СтрокаТаблицыКартинок.ФайлСуществует = ФайлКартинки.Существует();
			Если Не СтрокаТаблицыКартинок.ФайлСуществует Тогда
				ЗаписатьВЛог(ФайлКартинки.Имя,ФайлКартинки.Путь,Строка(Сч),ПредметСнабжения,"Не найден файл картинки!");
			КонецЕсли;
		КонецЕсли;
		
		Сч = Сч + 1;
		
		НаборЗаписей.MoveNext();
		
	КонецЦикла;
	
	СгруппироватьТаблицу();
	
	Сообщить("Загрузка данных окончена в "+ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Процедура СгруппироватьТаблицу()
	
	тзКартинкиПредметовСнабжения = РеквизитФормыВЗначение("КартинкиПредметовСнабжения",Тип("ТаблицаЗначений"));
	тзКартинкиПредметовСнабжения.Свернуть("Наименование,Обозначение,ФНН,ПредметСнабжения,ПутьКФайлуКартинки,ФайлСуществует");
	КартинкиПредметовСнабжения.Загрузить(тзКартинкиПредметовСнабжения);
	
КонецПроцедуры
 
&НаСервере
Функция ПолучитьСоответствиеПредметовСнабжения()
	
	СоответствиеПредметовСнабжения = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КаталогПредметовСнабжения.ФНН КАК ФНН,
	|	КаталогПредметовСнабжения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КаталогПредметовСнабжения КАК КаталогПредметовСнабжения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответствиеПредметовСнабжения.Вставить(Выборка.ФНН,Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СоответствиеПредметовСнабжения;
	
КонецФункции 
 
#КонецОбласти

//ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПИСИ ДАННЫХ В БД
#Область ЗаписьДанных

&НаСервере
Процедура ЗаписатьВЛог(ИмяФайла,ПутьКФайлу,ИдентификаторСтроки,Объект1С=Неопределено,Описание)
	
	ЛогЗагрузкиМенеджерЗаписи = РегистрыСведений.ЛогЗагрузки.СоздатьМенеджерЗаписи();
	ЛогЗагрузкиМенеджерЗаписи.Период = ТекущаяДата();
	ЛогЗагрузкиМенеджерЗаписи.ГУИД = Строка(Новый УникальныйИдентификатор);
	ЛогЗагрузкиМенеджерЗаписи.Файл = ИмяФайла;
	ЛогЗагрузкиМенеджерЗаписи.ИдентификаторСтроки = ИдентификаторСтроки;
	Если Объект1С <> Неопределено Тогда
		ЛогЗагрузкиМенеджерЗаписи.Объект1С = Объект1С;
	КонецЕсли; 
	ЛогЗагрузкиМенеджерЗаписи.Описание = Описание;
	ЛогЗагрузкиМенеджерЗаписи.ПутьКФайлу = ПутьКФайлу;
	ЛогЗагрузкиМенеджерЗаписи.Записать();
	
	Сообщить(ИмяФайла+" "+ИдентификаторСтроки+" "+Строка(Объект1С)+" "+Описание,СтатусСообщения.Важное);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	
	Если КартинкиПредметовСнабжения.Количество() = 0 Тогда
		Сообщить("Нет данных для записи!");
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьДанныеЗавершение", ЭтаФорма), "Данные в БД будут изменены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Сообщить("Запись данных начата в "+ТекущаяДата());
		Состояние("Запись данных в БД",,,БиблиотекаКартинок.ДлительнаяОперация48);
		ВыполнитьЗаписьДанных();
		Сообщить("Запись данных окончена в "+ТекущаяДата());
	Иначе
		Сообщить("Прервано пользователем!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаписьДанных()
	
	Сч = 1;
	ВсегоСтрок = КартинкиПредметовСнабжения.Количество();
	ДатаНачала = ТекущаяДата();
	
	Для каждого СтрокаКартинка Из КартинкиПредметовСнабжения Цикл
		
		Если СтрокаКартинка.ФайлСуществует Тогда
			
			УправлениеИнтерфейсом.ВывестиТекущееСостояние("Загрузка картинок",ДатаНачала,Сч,ВсегоСтрок);
			
			ФайлКартинки = Новый Файл(СтрокаКартинка.ПутьКФайлуКартинки);
			
			ПомещаемыеФайлы = Новый Массив;
			ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлКартинки.ПолноеИмя));
			
			ПомещенныеФайлы = Новый Массив;
			
			Если Не ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,, Ложь) Тогда
				
				ЗаписатьВЛог(ФайлКартинки.Имя,ФайлКартинки.Путь,Строка(Сч),СтрокаКартинка.ПредметСнабжения,"Не удалось поместить файл во временное хранилище");
				Продолжить;
				
			КонецЕсли;
			
			АдресВременногоХранилищаФайла = ПомещенныеФайлы.Получить(0).Хранение;
			
			ПрисоединенныйФайл = ПрисоединенныеФайлыСлужебныйВызовСервера.ДобавитьФайл(СтрокаКартинка.ПредметСнабжения,
			ФайлКартинки.ИмяБезРасширения,
			ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ФайлКартинки.Расширение),
			,
			ФайлКартинки.ПолучитьУниверсальноеВремяИзменения(),
			АдресВременногоХранилищаФайла);
			
			Если ПрисоединенныйФайл = Неопределено Тогда
				
				ЗаписатьВЛог(ФайлКартинки.Имя,ФайлКартинки.Путь,Строка(Сч),СтрокаКартинка.ПредметСнабжения,"Не присвоить файл предмету снабжения");	
				
			КонецЕсли;
			
		КонецЕсли; 
		
		Сч = Сч + 1;
		
	КонецЦикла; 
	
	Сообщить("Всего обновлено "+Строка(Сч)+" элементов");
	
КонецПроцедуры

#КонецОбласти 

//ПРОЦЕДУРЫ И ФУНКЦИИ СОБЫТИЙ ФОРМЫ
#Область СобытияФормы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ВыборФайла.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
